#pragma once
#define MEDIUM_COUNT 15;

const char* medium_questions[] = {
"把0.8亿改写成用“万”作单位的数是",
"2×3×6=36，2、3、6这三个数都是36的",
"一个零件的实际长度是7毫米，但在图上量得长是3.5厘米。这副图的比例尺是",
"把1/3米长的铁丝锯成相等的4段，每段是原长的",
"两个自然数，它们倒数的和是1/2，这两个数是",

"如果甲数的2/3等于乙数的3/5，那么甲数：乙数等于",
"用圆规画一个周长是12.56厘米的圆，圆规两脚之间的距离是",
"监利水文站用来测量水位高低和变化情况的选用（    ）统计图",
"一个圆柱体和一个圆锥体的底面积相等，圆锥的高是圆柱高的3倍。则圆锥的体积（    ）圆柱的体积。",
"一种商品先涨价10%，后又降价10%，现在的商品价格与原来相比",

"2700÷500的余数是",
"下列各数中不能化成有限小数的是",
"0.625×5.8＋5/8×4.2＝0.625×(5.8＋4.2)这是应用了乘法的",
"9/11用小数表示，精确到千分之一的结果是",
"一个圆柱体,挖去一个最大的圆锥体,成为一个容器，这个容器的体积是原来圆柱的"
};

struct
{
	unsigned int choise_number;
	TCHAR* choise[10];
} medium_choises[] = {
	4, {"0.8万","8000万","80000万","80000000万"},
	4, {"倍数","质因数","公约数","约数"},
	4, {"1：2","1：5","5：1","2：1"},
	4, {"1/3米","1/12米","1/4","1/12"},
	4, {"0和2","1和1","4和2","3和6"},

	4, {"6：15","10：9","15：6","9：10"},
	3, {"2厘米","4厘米","12.56厘米"},
	3, {"条形","折线","扇形"},
	3, {"小于","等于","大于"},
	3, {"升高了","降低了","没有变化"},

	3, {"2","20","200"},
	4, {"19/32","7/16","13/15","7/20"},
	3, {"交换律","结合律","分配律"},
	4, {"0.81","0.8180","0.818","0.819"},
	3, {"1/3","2/3","3/3"}
};


const short medium_answers[] = {
	1, 1, 1, 1, 1,
	1, 1, 1, 1, 1,
	1, 1, 1, 1, 1
};